{
  "introducing-reqwise": {
    "title": "Working with clients can be messy and complicated. That's why I made ReqWise.",
    "date": "2020-09-27T00:00:00.000Z",
    "blurb": "Building websites is fun. Collaborating with clients is hard.",
    "author": "Ross Hill",
    "preview": "Hi, I'm Ross. I started ReqWise for one reason: Building websites is …",
    "content": "\n\nHi, I'm Ross. I started ReqWise for one reason: Building websites is fun. Collaborating with clients is *hard*.\n\nI graduated from university earlier this year. As part of my computer science degree, I worked on a box-office ticketing website for a local festival as a capstone project. Although my team was eager to start coding the project, it became clear that the hardest part would be understanding the client's expectations, specifying their requirements, and getting approval on designs. Redoing work due to misunderstood requirements, keeping track of multiple stakeholders, and getting final sign-off were just some of the challenges we faced over the course of the year.\n\nIf you work in a digital agency or as a freelancer, you have probably faced similar challenges. Now there's a better way to collaborate with clients than sending documents over email. Manage all of your client interaction in one place, from the initial brainstorming of requirements to the final design sign-off.\n\n##Feature overview\n\n![Organizing requirements in ReqWise](https://reqwise.com/features/organize.png \"Organizing requirements in ReqWise\")\n<p class=\"imageCaption\">Organizing requirements in ReqWise</p>\n\nThe first feature ReqWise offers is **Questionnaires**, where you can ask your stakeholders questions to get an idea for what you're supposed to build. Questionnaires can be used to supplement time-consuming meetings.\n\nReqWise's next feature is **Organizing Requirements**. Arrange stakeholders' needs into requirements and sub-requirements. Prioritize the most important ones.\n\nReqWise isn't limited to text-based requirements. Upload **Files and Designs** from your computer or draw diagrams with the built-in editor.\n\nLastly, you can receive **Feedback and Approval** from clients. Stakeholders can review requirements and designs to make sure that you build what they want.\n\nWith ReqWise, client collaboration just got simpler. It's free while in Beta.\n\n<p align=\"center\" style=\"text-align: center; font-weight: 600;\">\n<a href=\"/sign-up/invite\">Give it a try!</a>\n</p>\n",
    "iso8601Date": "2020-09-26T20:00:00-04:00",
    "basename": "introducing-reqwise"
  },
  "remote-work": {
    "title": "Work Together from Anywhere, with ReqWise ",
    "date": "2020-10-16T00:00:00.000Z",
    "blurb": "How ReqWise enables remote and outsourced work",
    "author": "Ross Hill",
    "preview": "In my <a href=\"/blog/introducing-reqwise\">last blog post</a>, I …",
    "content": "\n\nIn my <a href=\"/blog/introducing-reqwise\">last blog post</a>, I highlighted some of ReqWise's features that help your team collaborate with clients across timezones and geographies. With ReqWise, you can gather information about stakeholder needs, propose software requirements and designs, and seek approval from stakeholders.\n\nEqually important is collaboration within your team. Remote work and outsourcing is becoming increasingly common among digital and creative agencies. ReqWise makes remote work easier by getting you out of your inbox and serving as a single source of truth for your team. ReqWise also integrates with Slack, so you can receive updates, propose requirements, and give feedback directly through your Slack workspace.\n\n**ReqWise is your team's single source of truth**. Collaborating on requirements and designs for a software project can be messy, and is often done over email with spreadsheets or text documents. ReqWise gets you out of your inbox and consolidates all of the project details in one place. Your ReqWise project is live-updating, so it always reflects the latest project requirements and designs. De-clutter your inbox by giving feedback on requirements from within ReqWise instead of over email.\n\n**ReqWise integrates with Slack**. We've worked hard to make ReqWise fit into your existing tools and processes as seamlessly as possible. Instead of periodically checking ReqWise for updates, you can connect it to a Slack workspace so you receive updates in a channel of your choosing. You can even respond to proposed requirements from within a Slack thread and propose new features and requirements with the command `/reqwise`.\n\n![ReqWise integrates with Slack](https://reqwise.com/features/slack.png \"ReqWise integrates with Slack\")\n<p class=\"imageCaption\">A ReqWise notification in Slack</p>\n\nAs we continue to adjust to COVID-19, many digital and creative agencies are embracing remote work and outsourcing. Software developers and project managers need better ways to collaborate with each other and with clients without meeting face-to-face. ReqWise aims to improve remote work by offering Slack integration and acting as an up-to-date repository for your requirements and designs\n\nWith ReqWise, remote work just got easier. It's free while in Beta.\n\n<p align=\"center\" style=\"text-align: center; font-weight: 600;\">\n<a href=\"/sign-up/invite\">Give it a try!</a>\n</p>\n",
    "iso8601Date": "2020-10-15T20:00:00-04:00",
    "basename": "remote-work"
  }
}
