{
  "introducing-reqwise": {
    "title": "Working with clients can be messy and complicated. That's why I made ReqWise.",
    "date": "2019-09-24T00:00:00.000Z",
    "blurb": "Building websites is fun. Collaborating with clients is hard.",
    "author": "Ross Hill",
    "preview": "Hi, I'm Ross. I started ReqWise for one reason: Building websites is …",
    "content": "\n\nHi, I'm Ross. I started ReqWise for one reason: Building websites is fun. Collaborating with clients is *hard*.\n\nI graduated from university earlier this year. As part of my computer science degree, I worked on a box-office ticketing website for a local festival as a capstone project. Although my team was eager to start coding the project, it became clear that the hardest part would be understanding the client's expectations, specifying their requirements, and getting approval on designs. Redoing work due to misunderstood requirements, keeping track of multiple stakeholders, and getting final sign-off were just some of the challenges we faced over the course of the year.\n\nIf you work in a digital agency or as a freelancer, you have probably faced similar challenges. Now there's a better way to collaborate with clients than sending documents over email. Manage all of your client interaction in one place, from the initial brainstorming of requirements to the final design sign-off.\n\n##Feature overview\n\nThe first feature ReqWise offers is **questionnaires**, where you can ask your stakeholders questions to get an idea for what you're supposed to build. Questionnaires can be used to supplement time-consuming meetings.\n\nReqWise's next feature is **organizing requirements**. Arrange stakeholders' needs into requirements and sub-requirements. Prioritize the most important ones.\n\n![ReqWise screenshot](https://reqwise.com/features/organize.png \"ReqWise screenshot\")\n<p class=\"imageCaption\">Organizing requirements in ReqWise</p>\n\nReqWise isn't limited to text-based requirements. Upload **files and designs** from your computer or draw diagrams with the built-in editor.\n\nLastly, you can receive **feedback and approval** from clients. Stakeholders can review requirements and designs to make sure that you build what they want.\n\nWith ReqWise, client collaboration just got simpler. It's free while in Beta. <a href=\"/sign-up/invite\">Give it a try</a>!\n",
    "iso8601Date": "2019-09-23T20:00:00-04:00",
    "basename": "introducing-reqwise"
  }
}
